<?php

namespace Database\Seeders;

use App\Models\CourseFaq;
use Illuminate\Database\Seeder;

class FaqSeeder extends Seeder
{
    public function run()
    {
        $faqs = [

            [
                'course' => 1,
                'question' => 'কোর্সটি কিভাবে পাবো?',
                'answer' => 'এটি একটি রেকর্ডেড ভিডিও কোর্স। উপরে বা নিচে “এখনি এনরোল করুন” বাটনে ক্লিক করে পেমেন্ট প্রক্রিয়া সম্পন্ন করার সাথে সাথে আমাদের সিস্টেম থেকে স্বয়ংক্রিয়ভাবে কোর্সের লিংক পেয়ে যাবেন।',
            ],
            [
                'course' => 1,
                'question' => 'আমার কি অনেক কিছু জানা লাগবে?',
                'answer' => 'না! বেসিক ইউটিউব সম্পর্কে নলেজ থাকলেই আপনি করতে পারবেন। এর বাইরে যা যা শেখা লাগবে কোর্সে বিস্তারিত শিখানো হবে।',
            ],
            [
                'course' => 1,
                'question' => 'কোর্সটি করতে কতক্ষণ লাগবে?',
                'answer' => 'কোর্সের দৈর্ঘ্য ৫ ঘন্টা ৪৭ মিনিট যেটা ৬ টি ক্লাসে বিভক্ত। যেহেতু এটি একটি রেকর্ডেড কোর্স, আপনি নিজের সময়মত কোর্সটি সম্পন্ন করতে পারবেন।',
            ],
            [
                'course' => 1,
                'question' => 'কোর্স কেনার পর আবার কোনো টাকা লাগবে কি না?',
                'answer' => 'না, একবার কোর্সে ভর্তি হলে আর কোনো অতিরিক্ত টাকা লাগবে না।',
            ],
            [
                'course' => 1,
                'question' => 'কোর্স ফি কীভাবে পরিশোধ করব?',
                'answer' => 'কোর্সে ভর্তি হতে চাইলে “Enroll Now” বাটনে ক্লিক করুন। সেখানে আমাদের অফিসিয়াল পেমেন্ট অপশনগুলো (বিকাশ, নগদ অথবা রকেট) দেখতে পাবেন। আপনার সুবিধাজনক মাধ্যম বেছে নিয়ে সহজেই পেমেন্ট সম্পন্ন করতে পারবেন।',
            ],
            [
                'course' => 1,
                'question' => 'কোর্সে যে টুলসগুলো লাগবে, সেগুলোর সাবস্ক্রিপশন আলাদাভাবে নিতে হবে কি?',
                'answer' => ' না, সবগুলো প্রয়োজনীয় টুলস আমরা প্রোভাইড করব। এগুলো দিয়ে আপনি আনলিমিটেড কাজ করতে পারবেন।',
            ],
            [
                'course' => 1,
                'question' => 'এই কোর্স করলে কত দিনের মধ্যে ইনকাম শুরু হবে?',
                'answer' => ' ইনকাম নির্ভর করবে আপনার কাজের উপর। তবে আমাদের প্রসেস ফলো করে নিয়মিত কাজ করলে 1-2 মাসের মধ্যেই ভালো রেজাল্ট আসবে ইনশাআল্লাহ।',
            ],
            [
                'course' => 1,
                'question' => 'আপনারা কতদিন সাপোর্ট করবেন?',
                'answer' => ' রিজিক এর মালিক আল্লাহ আমরা এত টুকু বলতে পারি সাকসেস না হওয়া পর্যন্ত আমাদের সাপোর্ট পাবেন। সাথেই আপনারও আমাদের দেখানো কাজ গুলো সব করতে হবে তাহলে ইনশাহ্আল্লাহ পারবেন।',
            ],
            [
                'course' => 1,
                'question' => 'কোর্সের মেয়াদ কত দিন?',
                'answer' => ' লাইফটাইম অ্যাক্সেস।',
            ],

        ];

        foreach ($faqs as $faq) {

            CourseFaq::create([
                'course_id' => $faq['course'],
                'question' => $faq['question'],
                'answer' => $faq['answer'],
            ]);
        }
    }
}
